RIET/src/DataProcessors/TemporaryImpExpDesktop/TemporaryImpExpDesktop.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>TemporaryImpExpDesktop</name>
</mdclass:DataProcessor>

RIET/src/Enums/TypesOfTemporaryImpExpTransaction/TypesOfTemporaryImpExpTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfTemporaryImpExpTransaction</name>
  <enumValues>
    <name>TemporaryImport</name>
  </enumValues>
  <enumValues>
    <name>TemporaryExport</name>
  </enumValues>
  <enumValues>
    <name>Prolongation</name>
  </enumValues>
  <enumValues>
    <name>ResponsibleChange</name>
  </enumValues>
  <enumValues>
    <name>Reexport</name>
  </enumValues>
  <enumValues>
    <name>Reimport</name>
  </enumValues>
  <enumValues>
    <name>PermanentImport</name>
  </enumValues>
  <enumValues>
    <name>PermanentExport</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ИмпортЭкспорт/ИмпортЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИмпортЭкспорт</name>
  <enumValues>
    <name>Import</name>
  </enumValues>
  <enumValues>
    <name>Export</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ЗакрытиеПоставки/ЗакрытиеПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеПоставки</name>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.TemporaryImpExpTransactions</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>Поставка</name>
    <type>
      <types>DocumentRef.TemporaryImpExpTransactions</types>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОбменаРИЕТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сопоставление</name>
    <attributes>
      <name>СтрокаИнвойса</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварСтрокиГТД</name>
      <type>
        <types>CatalogRef.ТоварыСтрокГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/TemporaryImpExpTransactions/TemporaryImpExpTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TemporaryImpExpTransactions</name>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfTemporaryImpExpTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFileNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NewResponsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAJobReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShipperName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsRegime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>NewCustomsFileNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileLineNo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/DataProcessors/TemporaryImpExpDesktop/Forms/History/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "History of temporary import of Item """ + СокрЛП(Параметры.Item) + """";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Item", Параметры.Item);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗакрытиеПоставкиСопоставление.Ссылка КАК Ссылка,
		|	ЗакрытиеПоставкиСопоставление.Ссылка.Представление КАК ПредставлениеСсылки,
		|	ВЫБОР
		|		КОГДА ЗакрытиеПоставкиСопоставление.Ссылка.Поставка ССЫЛКА Документ.Поставка
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.TypesOfTemporaryImpExpTransaction.TemporaryImport)
		|		КОГДА ЗакрытиеПоставкиСопоставление.Ссылка.Поставка ССЫЛКА Документ.ExportShipment
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.TypesOfTemporaryImpExpTransaction.TemporaryExport)
		|	КОНЕЦ КАК TypeOfTransaction,
		|	ВЫРАЗИТЬ(ЗакрытиеПоставкиСопоставление.Ссылка.Comment КАК СТРОКА(1000)) КАК Comments,
		|	ЗакрытиеПоставкиСопоставление.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.ЗакрытиеПоставки.Сопоставление КАК ЗакрытиеПоставкиСопоставление
		|ГДЕ
		|	ЗакрытиеПоставкиСопоставление.СтрокаИнвойса = &Item
		|	И ЗакрытиеПоставкиСопоставление.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CustomsFilesLight.Ссылка,
		|	CustomsFilesLight.Ссылка.Представление,
		|	ВЫБОР
		|		КОГДА CustomsFilesLight.ImportExport = ЗНАЧЕНИЕ(Перечисление.ИмпортЭкспорт.Import)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.TypesOfTemporaryImpExpTransaction.TemporaryImport)
		|		КОГДА CustomsFilesLight.ImportExport = ЗНАЧЕНИЕ(Перечисление.ИмпортЭкспорт.Export)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.TypesOfTemporaryImpExpTransaction.TemporaryExport)
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(CustomsFilesLight.Comment КАК СТРОКА(1000)),
		|	CustomsFilesLight.Дата
		|ИЗ
		|	Документ.CustomsFilesLight.Items КАК CustomsFilesLightItems
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CustomsFilesLight КАК CustomsFilesLight
		|		ПО CustomsFilesLightItems.Ссылка = CustomsFilesLight.Ссылка
		|ГДЕ
		|	CustomsFilesLightItems.Item = &Item
		|	И CustomsFilesLight.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	TemporaryImpExpTransactionsItems.Ссылка,
		|	TemporaryImpExpTransactionsItems.Ссылка.Представление,
		|	TemporaryImpExpTransactionsItems.Ссылка.TypeOfTransaction,
		|	ВЫРАЗИТЬ(TemporaryImpExpTransactionsItems.Ссылка.Comments КАК СТРОКА(1000)),
		|	TemporaryImpExpTransactionsItems.Ссылка.Дата
		|ИЗ
		|	Документ.TemporaryImpExpTransactions.Items КАК TemporaryImpExpTransactionsItems
		|ГДЕ
		|	TemporaryImpExpTransactionsItems.Item = &Item
		|	И TemporaryImpExpTransactionsItems.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
	УстановитьПривилегированныйРежим(Истина);	
	Таблица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Таблица.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(,ТекущиеДанные.Ссылка);
		
КонецПроцедуры
